app/views/cuisine_tags/_form.html.erb

SELECT `cuisine_tags`.* FROM `cuisine_tags` WHERE (id > 1)
---
    <%= cuisine_tag_form.label :title, 'Cuisine name:' %>
    <%= cuisine_tag_form.select :title, options_for_select( CuisineTag.where("id > ?", 1).map {|c| [c.title, c.id]}), :include_blank => false%>