app/views/home/index.html.erb

          if (hr <= 9) {
            hr = "0" + hr.toString();
          } else {
            hr = hr.toString();
          }
          if (min <= 9) {
            min = "0" + min.toString();
          } else {
            min = min.toString();
          }
          time=hr+":"+min
        }
      }
      else if (meridian=='PM'){
        // console.log(time.substring(0,2));
        hour=parseInt(time.substring(0, time.indexOf(':')));
        if(hour!=12){
          time=(12+hour)+":"+time.substring(time.indexOf(':') + 1, time.length-1)
        }
      }
      location.href="restaurants/list_restaurants?date="+fullDate+"&time="+time+"&quantity="+$('#people').val()+"&cuisine_type="+cuisine_type+"&date_format="+date+"&time_format="+fullTime;
    });
---
SELECT `restaurants`.* FROM `restaurants` ORDER BY RAND() DESC LIMIT 1