app/views/restaurants/_form.html.erb

        <div class="input-append btn-group">
        <input id="restaurant_mon" name="restaurant[mon]" type="hidden" value="<%= @restaurant.mon.present? && @restaurant.mon != 0  ? @restaurant.inventory_template_groups.find_by_id(@restaurant.mon).id : "" %>">
---
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = ? LIMIT 1  [["id", "1"]]