app/views/restaurants/show.html.erb

Available Bookings<br>
<% @restaurant.inventories.each do |n| %>
---
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`restaurant_id` = 1