app/controllers/home_controller.rb

  def index
	  @restaurant1 = Restaurant.first(:order => "RAND()")
---
SELECT `restaurants`.* FROM `restaurants` ORDER BY RAND() DESC LIMIT 1

  def search
    @search = Hash.new
    @search["cuisine"]  = "Any" unless params[:cuisine].present?
    @search["price"]    = "Any" unless params[:price].present?
    @search["location"] = "Any" unless params[:location].present?
    @search["cuisine"]  ||= params[:cuisine]
    @search["price"]    ||= params[:price]
    @search["location"] ||= params[:location]

    @search["cuisine"].map! {|c| c=CuisineTag.find(c).title}

    if @search["price"][0]!="Any" and
          @search["cuisine"][0]!="Any"
      # @restaurants = Restaurant.near(@search, 10).limit(10)
      @search_results = Restaurant.with_cuisine(@search["cuisine"]).with_price(@search["price"])
    elsif @search["cuisine"][0]=="Any" and
            @search["price"][0]!="Any"
      @search_results = Restaurant.with_price(@search["price"])
    elsif @search["cuisine"][0]!="Any" and
            @search["price"][0]=="Any"
      @search_results = Restaurant.with_cuisine(@search["cuisine"])
    else
      @search_results = Restaurant.all
---
SELECT `cuisine_tags`.* FROM `cuisine_tags` WHERE `cuisine_tags`.`id` = ? LIMIT 1  [["id", "37"]]
SELECT `restaurants`.* FROM `restaurants` INNER JOIN `cuisine_tags_restaurants` ON `cuisine_tags_restaurants`.`restaurant_id` = `restaurants`.`id` INNER JOIN `cuisine_tags` ON `cuisine_tags`.`id` = `cuisine_tags_restaurants`.`cuisine_tag_id` WHERE (cuisine_tags.title LIKE '%American%' or cuisine_tags.title LIKE '%Chinese%')