app/controllers/home_controller.rb

SELECT `rewards`.* FROM `rewards` WHERE `rewards`.`user_id` = 2
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
  def index
    @active_home = "active"
    if params[:set_locale]
      redirect_to root_path(locale: params[:set_locale])
    elsif
      # @restaurant1 = Restaurant.first(:order => "RAND()")
      # @restaurant2 = Restaurant.last(:order => "RAND()")
      if user_signed_in?
        @rewards = current_user.rewards
      end
    end

    @restaurants = []
    @restaurant = Restaurant.new
    arr = []
    # when will be many restaurants need to limit records and rnd offset
    # rnd = rand(Restaurant.count-2)
    rnd = rand(0)
    Restaurant.offset(rnd).limit(50).each {|r| arr << r.id }
    # arr = arr.sample(3)
    arr = arr.sample(Restaurant.count)
    arr.each {|id| @restaurants <<  Restaurant.find(id) }

SELECT COUNT(*) FROM `restaurants` WHERE (cuisine LIKE '%Chinese, Sukiyaki/Shabu%')
---
  def search
    @search_terms = []
    if !params['name'].blank?
      @search_results_full = Restaurant.where("name like ?", "%#{params['name']}%")
      @search_results = @search_results_full.page(params[:page])