app/controllers/inventory_templates_controller.rb

  def index
    # @inventory_templates = InventoryTemplate.order("id desc").page(params[:page])
    itg_all = current_owner.restaurant.inventory_template_groups
    @inventory_templates = itg_all.map do |itg|
---
SELECT `inventory_templates`.* FROM `inventory_templates`