app/controllers/inventories_controller.rb

SELECT `inventories`.* FROM `inventories`
---
  def index
    @inventories = Inventory.all