app/controllers/reservations_controller.rb

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`restaurant_id` = 1
---
  def index
    if user_signed_in?
      @reservations = current_user.reservations
    elsif owner_signed_in?
      @reservations = []
      # current_owner.restaurants.each {|rest| @reservations += rest.reservations}
      if current_owner.restaurant.blank?
        @reservations = []
      else
        @reservations = current_owner.restaurant.reservations
      end
    end
    @reservations = @reservations.order("id desc").page(params[:page])

SELECT `restaurants`.* FROM `restaurants`
---
  def new
    @reservation = Reservation.new

    unless params[:start_time].blank?
      @reservation.start_time = params[:start_time]
      @reservation.end_time   = params[:start_time]
      @reservation.date = params[:date]
    end

    @reservation.restaurant_id = params[:restaurant_id]

    if owner_signed_in? and not current_owner.restaurant.blank?

SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @reservation = Reservation.find(params[:id])