app/controllers/restaurants_controller.rb

SELECT `restaurants`.* FROM `restaurants`
---
  def index
    @restaurants = Restaurant.all

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`restaurant_id` = 1
---
  def show
    @restaurant = Restaurant.find(params[:id])
    @image_tag_string = "http://maps.google.com/maps/api/staticmap?key=AIzaSyC77WBfl-zki0vS7h9zyKyYg3htKcERvuo&size=550x300"
    # @image_tag_string << "&center=#{@restaurant.lat}%2C#{@restaurant.lng}"
    # @image_tag_string << "&markers=icon:http://tinyurl.com/o39bbb3%7C#{@restaurant.lat}%2C#{@restaurant.lng}"
    # @image_tag_string << "&markers=icon:http://tinyurl.com/oyoepzu%7C#{@restaurant.lat}%2C#{@restaurant.lng}"
    @image_tag_string << "&markers=icon:http://tinyurl.com/pgdsbxb%7C#{@restaurant.lat}%2C#{@restaurant.lng}"
    @image_tag_string << '&sensor=false&zoom=15'

    @date = params[:date] ? Date.parse(params[:date]) : Date.today
    @quantity = []
    4.times {|i| @quantity[i] = []}
    @restaurant.inventories.each do |inv|

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @restaurant = Restaurant.find(params[:id])

INSERT INTO `restaurants` (`budget`, `category`, `created_at`, `cuisine`, `lat`, `lng`, `misc`, `name`, `owner_id`, `price`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @restaurant = Restaurant.new(params[:restaurant])
    @restaurant.owner_id = current_owner.id

    respond_to do |format|
      if @restaurant.save

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `restaurants` SET `days_in_advance` = 4, `min_booking_time` = 18, `res_duration` = 15, `updated_at` = '2013-09-25 14:02:53' WHERE `restaurants`.`id` = 1
---
  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.owner_id = current_owner.id

    respond_to do |format|
      if @restaurant.update_attributes(params[:restaurant])