app/controllers/rewards_controller.rb

SELECT `rewards`.* FROM `rewards` WHERE `rewards`.`id` = ? LIMIT 1  [["id", "2"]]
---
  def show
    @reward = Reward.find(params[:id])